{
	"projects": [
		{
			"name": "PLib",
			"url": "https://github.com/9jh1/plib",
			"tags": ["c","opensource", "library", "plib"],
			"tagline": "Ansi C library",
			"description": [
				{
					"cont": "Simple argument parsing that allows you to easily set up your program without the need for bukly and ugly loops and else if blocks.",
					"file": ["plib.c", "plib.h"]
				},
				{
					"cont": "Basic non-threaded input loop that allows for not just regular keys but all mouse input (SCROLL, MOVE, RELEASE) along with a few special keys eg Control+G.",
					"file": ["lib/input.c", "lib/input.h"]
				},
				{
					"cont": "Optimised styled box renderer that allows you to draw a box onto the screen at any point. this is bundled with the input loop code as you can easily set up input detection on boxes using it.",
					"file": ["lib/input.c", "lib.input.h"]
				}
			]
		},
		{
			"name": "Auto Read-Run(er)",
			"url": "https://github.com/9jh1/arr",
			"tags": ["c", "opensource", "gnu", "arr"],
			"tagline": "Ansi C",
			"description": [
				{
					"cont": "Takes in a file and watches its contense, if the contense changes it runs a given command.",
					"file": "arr.c"
				}
			]
		},
		{
			"name": "xobar",
			"url": "https://github.com/9JH1/xobar",
			"tags": ["c", "opensource", "tomlc", "xobar", "depricated"],
			"tagline": "Status bar",
			"description": [
				{
					"cont": "Custom text statusbar. Made as a replacement for i3status.",
					"file": ""
				}, 
				{
					"cont": "Uses the tomlc library to parse a toml configuration file",
					"file": ""
				}
			]
		},
		{
			"name": "motionlayer",
			"url": "https://github.com/9JH1/motionlayer",
			"tags": ["c", "opensource", "wip", "motionlayer"],
			"tagline": "X11 video wallpaper",
			"description" : [
				{
					"cont": "Uses MPV to set a video wallpaper",
					"file": ""
				},
				{
					"cont": "Use https://github.com/9jh1/C instead",
					"file": ""
				}
			]
		}
	],
	"journal": [
		{
			"title": "Initial Commit",
			"date": "2025-12-01T23:20:19.976Z",
			"tags": ["notopic"],
			"content": "Hello World!\nWelcome to my new website!"
		},
		{
			"title": "New projects",
			"date": "2025-12-02T01:23:06.100Z",
			"tags": ["projects", "wip", "c", "navtui", "0bchat"],
			"content": "I've started development on 0bchat - A end to end encrypted chat client using C. With PLib V5.0.1 I've started writing navtui, a navidrome client terminal application, both of these projects are privated at the moment but will go public on their first release. I don't want another incident with unfinished repos ehm motionlayer.."
		},
		{
			"title": "Link Sharing!!",
			"date": "2025-12-02T10:45:42Z",
			"tags": ["notopic"],
			"content": "This page now supports sharing of specific journal entries!!\nTry it out by pressing the text below:"
		}, 
		{
			"title": "ew protonmail",
			"date": "2025-12-04T00:03:53Z",
			"tags": ["privacy", "tui", "usability"],
			"content": "I've been using proton mail for a few months now, and don't get me wrong I like proton as a company and I understand that they're just trying to make some funding. Personally I'm not a big fan of the corperate presence thats becoming the norm. Now I like to use the aerc email client, small issue with this, proton dosent allow users to use clients other then their offical client.. The only way theyve provided to negate this is to have a proton-mail-plus subscription AND a desktop application (protonmail-bridge-core) which acts as the other end of the encryption that way the client using the proton email can actually read emails..\n\nI have no issue with some features being behind a paywall again proton do need to make some money somehow but this is such a basic feature..\n\nTo fix this issue I've created a new email at disroot.org which provides end-to-end symetric encryption using pgp, disroot.org also supports 3rd party clients out of the box. I've set up my accounts so that my proton account forwards emails to my disroot account but in doing so I also noticed that proton does not forward emails sent from its own address so emails sent from your own email to yourself will not be forewarded.. ill also say that there are very few options given to actually change the forwarding settings.. In gmail the options to delete, archive or keep forwarded mail is right there but in proton no such feature exists. Ontop of all of this disroot also has a contact book system that allows you to import your contacts from other services eg google contacts, this is yet another feature that protonmail does not have.\n\nThis website still shows a google email as a contact email all emails sent to that address will be forwarded to my disroot email. go check out disroot.org, note that they are donation run and therefore have limited time and because of this they close registrations during the weekend. After signing up you have a 48 hour period where a maintainer will have to manually approve your account request. There is no mention of the prior when signing up."
		}
	]
}
